Documents/ВыдачаБланков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ВыдачаБланков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетДополнительныхЛистов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидБланка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСетификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эксперт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЛисты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоБланков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыдачаБланков/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КонечныйНомерПриИзменении(Элемент)
	
	объект_ВсегоБланков=объект.КонечныйНомер-объект.НачальныйНомер+1;
	
	если  объект_ВсегоБланков>100 тогда
		объект.КонечныйНомер=0;   
		объект.ВсегоБланков=0;   
	иначе   
		
		объект.ВсегоБланков=объект_ВсегоБланков;
		
	конецесли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НачальныйНомерПриИзменении(Элемент)
	
	объект_ВсегоБланков=объект.КонечныйНомер-объект.НачальныйНомер+1;
	
	если  объект_ВсегоБланков>100 тогда
		объект.НачальныйНомер=0;   
		объект.ВсегоБланков=0;   
	иначе   
		
		объект.ВсегоБланков=объект_ВсегоБланков;
		
	конецесли;
	
	ПроверитьНачальныйНомерПриИзменении();	 
	
	//объект.ВсегоБланков=объект.КонечныйНомер-объект.НачальныйНомер+1;
КонецПроцедуры


&НаСервере
Процедура ПроверитьНачальныйНомерПриИзменении()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НомераБланков.Номер КАК Номер,
	|	НомераБланков.ВидСертификата КАК ВидСертификата
	|ИЗ
	|	РегистрСведений.НомераБланков КАК НомераБланков
	|ГДЕ
	|	НомераБланков.Номер = &Номер
	|	И НомераБланков.ВидСертификата = &ВидСертификата";
	
	Запрос.УстановитьПараметр("ВидСертификата", объект.ВидБланка);
	Запрос.УстановитьПараметр("Номер", объект.НачальныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	если Выборка.Следующий() тогда
		
		объект.НачальныйНомер=0;   
		объект.ВсегоБланков=0;   
		сообщить("существует");
		
	Конецесли;
	
конецПроцедуры
